#ifndef STRF_DETAIL_UTF_HPP
#define STRF_DETAIL_UTF_HPP

//  Copyright (C) (See commit logs on github.com/robhz786/strf)
//  Distributed under the Boost Software License, Version 1.0.
//  (See accompanying file LICENSE_1_0.txt or copy at
//  http://www.boost.org/LICENSE_1_0.txt)

#include <strf/detail/facets/charset.hpp>
#include <strf/detail/standard_lib_functions.hpp>

namespace strf {

#define STRF_UTF_CHECK_DST                                      \
    STRF_IF_UNLIKELY (dst_it >= dst_end) {                     \
        return {seq_begin, dst_it, reason::insufficient_output_space};    \
    }

#define STRF_UTF_CHECK_DST_SIZE(SIZE)                           \
    STRF_IF_UNLIKELY (dst_it + (SIZE) > dst_end) {             \
        return {seq_begin, dst_it, reason::insufficient_output_space};    \
    }

namespace detail {

template <typename CharT>
inline STRF_HD void repeat_sequence
    ( strf::transcode_dst<CharT>& dst
    , std::ptrdiff_t count
    , CharT ch0
    , CharT ch1 ) noexcept
{
    auto *p = dst.buffer_ptr();
    constexpr std::ptrdiff_t seq_size = 2;
    std::ptrdiff_t space = 0;
    std::ptrdiff_t inner_count = 0;
    while (1) {
        space = (dst.buffer_end() - p) / seq_size;
        inner_count = (space < count ? space : count);
        for (; inner_count > 0; --inner_count) {
            p[0] = ch0;
            p[1] = ch1;
            p += seq_size;
        }
        dst.advance_to(p);
        STRF_IF_LIKELY (count <= space) {
            return;

    return codepoint >> 11 == 0x1B;
}
constexpr STRF_HD bool is_high_surrogate(unsigned codepoint) noexcept
{
    return codepoint >> 10 == 0x36;
}
constexpr STRF_HD bool is_low_surrogate(unsigned codepoint) noexcept
{
    return codepoint >> 10 == 0x37;
}
constexpr STRF_HD bool not_surrogate(unsigned codepoint)
{
    return codepoint >> 11 != 0x1B;
}
constexpr STRF_HD bool not_high_surrogate(unsigned codepoint)
{
    return codepoint >> 10 != 0x36;
}
constexpr STRF_HD bool not_low_surrogate(unsigned codepoint)
{
    return codepoint >> 10 != 0x37;
}
constexpr STRF_HD unsigned utf8_decode(unsigned ch0, unsigned ch1)
{
    return (((ch0 & 0x1F) << 6) |
            ((ch1 & 0x3F) << 0));
}
constexpr STRF_HD unsigned utf8_decode(unsigned ch0, unsigned ch1, unsigned ch2)
{
    return (((ch0 & 0x0F) << 12) |
            ((ch1 & 0x3F) <<  6) |
            ((ch2 & 0x3F) <<  0));
}
constexpr STRF_HD unsigned utf8_decode(unsigned ch0, unsigned ch1, unsigned ch2, unsigned ch3)
{
    return (((ch0 & 0x07) << 18) |
            ((ch1 & 0x3F) << 12) |
            ((ch2 & 0x3F) <<  6) |
            ((ch3 & 0x3F) <<  0));
}

template <typename IntT, strf::detail::enable_if_t<std::is_same<unsigned, IntT>::value, int> =0>
constexpr STRF_HD bool is_utf8_continuation(IntT ch)
{
    return (ch & 0xC0) == 0x80;
}

template <typename IntT, strf::detail::enable_if_t<sizeof(IntT) == 1, int> =0>
constexpr STRF_HD bool is_utf8_continuation(IntT ch)
{
    return is_utf8_continuation(static_cast<unsigned>(static_cast<unsigned char>(ch)));
}

template <typename IntT, strf::detail::enable_if_t<std::is_same<unsigned, IntT>::value, int> =0>
constexpr STRF_HD bool not_utf8_continuation(IntT ch)
{
    return (ch & 0xC0) != 0x80;
}

template <typename IntT, strf::detail::enable_if_t<sizeof(IntT) == 1, int> =0>
constexpr STRF_HD bool not_utf8_continuation(IntT ch)
{
    return not_utf8_continuation(static_cast<unsigned>(static_cast<unsigned char>(ch)));
}

inline STRF_HD unsigned utf8_decode_first_2_of_3(unsigned ch0, unsigned ch1)
{
    return static_cast<unsigned>(((ch0 & 0x0F) << 6) | (ch1 & 0x3F));
}

inline STRF_HD bool first_2_of_3_are_valid(unsigned x, bool lax_surrogate_policy)
{
    return (lax_surrogate_policy || (x >> 5) != 0x1B);
}
inline STRF_HD bool first_2_of_3_are_valid
    ( unsigned ch0
    , unsigned ch1
    , bool lax_surr )
{
    return first_2_of_3_are_valid(utf8_decode_first_2_of_3(ch0, ch1), lax_surr);
}

inline STRF_HD unsigned utf8_decode_first_2_of_4(unsigned ch0, unsigned ch1)
{
    return ((ch0 ^ 0xF0) << 6) | (ch1 & 0x3F);
}

inline STRF_HD unsigned utf8_decode_last_2_of_4(unsigned x, unsigned ch2, unsigned ch3)
{
    return (x << 12) | ((ch2 & 0x3F) <<  6) | (ch3 & 0x3F);
}

inline STRF_HD bool first_2_of_4_are_valid(unsigned x)
{
    return 0xF < x && x < 0x110;
}

inline STRF_HD bool first_2_of_4_are_valid(unsigned ch0, unsigned ch1)
{
    return first_2_of_4_are_valid(utf8_decode_first_2_of_4(ch0, ch1));
}

} // namespace detail

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf8>
{
public:
    static_assert(sizeof(SrcCharT) == 1, "Incompatible character type for UTF-8");
    static_assert(sizeof(DstCharT) == 1, "Incompatible character type for UTF-8");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t size
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags);

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags ) noexcept
    {
        const auto s = (src_end - src);
        if (s <= limit) {
            return {s, src_end, transcode_stop_reason::completed};
        }
        while (limit > 0 && detail::is_utf8_continuation(src[limit])) {
            --limit;
        }
        return {limit, src + limit, transcode_stop_reason::insufficient_output_space};
    }

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_continue_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_stop_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf16>
{
public:
    static_assert(sizeof(SrcCharT) == 1, "Incompatible character type for UTF-8");
    static_assert(sizeof(DstCharT) == 2, "Incompatible character type for UTF-16");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_continue_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_stop_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf32>
{
public:
    static_assert(sizeof(SrcCharT) == 1, "Incompatible character type for UTF-8");
    static_assert(sizeof(DstCharT) == 4, "Incompatible character type for UTF-32");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_continue_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_stop_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf8>
{
public:
    static_assert(sizeof(SrcCharT) == 2, "Incompatible character type for UTF-16");
    static_assert(sizeof(DstCharT) == 1, "Incompatible character type for UTF-8");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode_lax_surr_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end );

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode_strict_surr_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_stop_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_continue_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf16>
{
public:
    static_assert(sizeof(SrcCharT) == 2, "Incompatible character type for UTF-16");
    static_assert(sizeof(DstCharT) == 2, "Incompatible character type for UTF-16");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags);

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags ) noexcept
    {
        const auto size = (src_end - src);
        if (size <= limit) {
            return {size, src_end, transcode_stop_reason::completed};
        }
        if ( limit > 0
          && detail::is_high_surrogate(src[limit - 1])
          && detail::is_low_surrogate(src[limit]) )
        {
            --limit;
        }
        return {limit, src + limit, transcode_stop_reason::insufficient_output_space};
    }

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    template <bool HasLimit, bool StopOnInvalidSeq>
    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf32>
{
public:
    static_assert(sizeof(SrcCharT) == 2, "Incompatible character type for UTF-16");
    static_assert(sizeof(DstCharT) == 4, "Incompatible character type for UTF-32");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_continue_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_stop_on_inv_seq_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf8>
{
public:
    static_assert(sizeof(SrcCharT) == 4, "Incompatible character type for UTF-32");
    static_assert(sizeof(DstCharT) == 1, "Incompatible character type for UTF-1");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    template <bool StopOnLimit, bool StopOnInvalidSeq, bool StricSurrPoli>
    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf16>
{
public:
    static_assert(sizeof(SrcCharT) == 4, "Incompatible character type for UTF-32");
    static_assert(sizeof(DstCharT) == 2, "Incompatible character type for UTF-16");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags flags ) noexcept;

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return unsafe_transcode;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }

private:

    template <bool StopOnLimit, bool StopOnInvalidSeq, bool StricSurrPoli>
    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size_
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit ) noexcept;
};

template <typename SrcCharT, typename DstCharT>
class static_transcoder<SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf32>
{
public:
    static_assert(sizeof(SrcCharT) == 4, "Incompatible character type for UTF-32");
    static_assert(sizeof(DstCharT) == 4, "Incompatible character type for UTF-32");

    using src_char_type = SrcCharT;
    using dst_char_type = DstCharT;

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags );

    static STRF_HD strf::transcode_size_result<SrcCharT> transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags );

    static STRF_HD strf::transcode_result<SrcCharT, DstCharT> unsafe_transcode
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , DstCharT* dst
        , DstCharT* dst_end
        , strf::transcoding_error_notifier* err_notifier
        , strf::transcode_flags flags )
    {
        return detail::bypass_unsafe_transcode(src, src_end, dst, err_notifier, flags);
    }

    static STRF_HD strf::transcode_size_result<SrcCharT> unsafe_transcode_size
        ( const SrcCharT* src
        , const SrcCharT* src_end
        , std::ptrdiff_t limit
        , strf::transcode_flags )
    {
        const auto s = (src_end - src);
        if (s <= limit) {
            return {s, src_end, transcode_stop_reason::completed};
        }
        return {limit, src + limit, transcode_stop_reason::insufficient_output_space};
    }

    static STRF_HD strf::transcode_f<SrcCharT, DstCharT> transcode_func() noexcept
    {
        return transcode;
    }
    static STRF_HD strf::transcode_size_f<SrcCharT> transcode_size_func() noexcept
    {
        return transcode_size;
    }
    static STRF_HD strf::unsafe_transcode_f<SrcCharT, DstCharT> unsafe_transcode_func() noexcept
    {
        return detail::bypass_unsafe_transcode<SrcCharT, DstCharT>;
    }
    static STRF_HD strf::unsafe_transcode_size_f<SrcCharT> unsafe_transcode_size_func() noexcept
    {
        return unsafe_transcode_size;
    }
};

template <typename SrcCharT, typename DstCharT>
using utf8_to_utf8 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf8 >;
template <typename SrcCharT, typename DstCharT>
using utf8_to_utf16 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf16 >;
template <typename SrcCharT, typename DstCharT>
using utf8_to_utf32 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf8, strf::csid_utf32 >;

template <typename SrcCharT, typename DstCharT>
using utf16_to_utf8 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf8 >;
template <typename SrcCharT, typename DstCharT>
using utf16_to_utf16 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf16 >;
template <typename SrcCharT, typename DstCharT>
using utf16_to_utf32 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf16, strf::csid_utf32 >;

template <typename SrcCharT, typename DstCharT>
using utf32_to_utf8 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf8 >;
template <typename SrcCharT, typename DstCharT>
using utf32_to_utf16 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf16 >;
template <typename SrcCharT, typename DstCharT>
using utf32_to_utf32 = strf::static_transcoder
    < SrcCharT, DstCharT, strf::csid_utf32, strf::csid_utf32 >;

template <typename SrcCharT, typename DstCharT>
using utf_to_utf = strf::static_transcoder
    < SrcCharT, DstCharT, strf::get_csid_utf<SrcCharT>(), strf::get_csid_utf<DstCharT>() >;

template <typename CharT>
class static_charset<CharT, strf::csid_utf8>
{
public:
    static_assert(sizeof(CharT) == 1, "Incompatible character type for UTF-8");
    using code_unit = CharT;
    using char_type STRF_DEPRECATED = CharT;

    static STRF_HD const char* name() noexcept
    {
        return "UTF-8";
    };
    static constexpr STRF_HD strf::charset_id id() noexcept
    {
        return strf::csid_utf8;
    }
    static constexpr STRF_HD char32_t replacement_char() noexcept
    {
        return 0xFFFD;
    }
    static constexpr STRF_HD int replacement_char_size() noexcept
    {
        return 3;
    }
    static constexpr STRF_HD int validate(char32_t ch) noexcept
    {
        return ( ch < 0x80     ? 1 :
                 ch < 0x800    ? 2 :
                 ch < 0x10000  ? 3 :
                 ch < 0x110000 ? 4 : -1 );
    }
    static constexpr STRF_HD int encoded_char_size(char32_t ch) noexcept
    {
        return ( ch < 0x80     ? 1 :
                 ch < 0x800    ? 2 :
                 ch < 0x10000  ? 3 :
                 ch < 0x110000 ? 4 : 3 );
    }
    static STRF_HD CharT* encode_char
        ( CharT* dst, char32_t ch ) noexcept;

    static STRF_HD void encode_fill
        ( strf::transcode_dst<CharT>&, std::ptrdiff_t count, char32_t ch );

    static STRF_HD strf::count_codepoints_result<CharT> count_codepoints_fast
        ( const CharT* src, const CharT* src_end
        , std::ptrdiff_t max_count ) noexcept;

    static STRF_HD strf::count_codepoints_result<CharT> count_codepoints
        ( const CharT* src, const CharT* src_end
        , std::ptrdiff_t max_count ) noexcept;

    static STRF_HD void write_replacement_char
        ( strf::transcode_dst<CharT>& );

    static STRF_HD char32_t decode_unit(CharT ch) noexcept
    {
        STRF_IF_LIKELY (ch < 0x80)
            return static_cast<char32_t>(ch);
        return 0xFFFD;
    }
    static STRF_HD strf::encode_char_f<CharT> encode_char_func() noexcept
    {
        return encode_char;
    }
    static STRF_HD strf::encode_fill_f<CharT> encode_fill_func() noexcept
    {
        return encode_fill;
    }
    static STRF_HD strf::validate_f validate_func() noexcept
    {
        return validate;
    }
    static STRF_HD strf::write_replacement_char_f<CharT>
    write_replacement_char_func() noexcept
    {
        return write_replacement_char;
    }
    static constexpr STRF_HD strf::utf8_to_utf8<CharT, CharT> sanitizer() noexcept
    {
        return {};
    }
    static constexpr STRF_HD strf::utf32_to_utf8<char32_t, CharT> from_u32() noexcept
    {
        return {};
    }
    static constexpr STRF_HD strf::utf8_to_utf32<CharT, char32_t> to_u32() noexcept
    {
        return {};
    }
    template <typename SrcCharT>
    static STRF_HD strf::dynamic_transcoder<SrcCharT, CharT>
    find_transcoder_from(strf::tag<SrcCharT>, strf::charset_id id) noexcept
    {
        return find_transcoder_from<SrcCharT>(id);
    }
    template <typename DstCharT>
    static STRF_HD strf::dynamic_transcoder<CharT, DstCharT>
    find_transcoder_to(strf::tag<DstCharT>, strf::charset_id id) noexcept
    {
        return find_transcoder_to<DstCharT>(id);
    }
    template <typename DstCharT>
    static STRF_HD strf::dynamic_transcoder<CharT, DstCharT>
    find_transcoder_to(strf::charset_id id) noexcept
    {
        using transcoder_type = strf::dynamic_transcoder<CharT, DstCharT>;
        if (id == strf::get_csid_utf<DstCharT>()) {
            return transcoder_type{strf::utf_to_utf<CharT, DstCharT>{}};
        }
        return {};
    }
    template <typename SrcCharT>
    static STRF_HD strf::dynamic_transcoder<SrcCharT, CharT>
    find_transcoder_from(strf::charset_id id) noexcept
    {
        using transcoder_type = strf::dynamic_transcoder<SrcCharT, CharT>;
        if (id == strf::get_csid_utf<SrcCharT>()) {
            return transcoder_type{strf::utf_to_utf<SrcCharT, CharT>{}};
        }
        return {};
    }
    static strf::dynamic_charset<CharT> to_dynamic() noexcept
    {
        static const strf::dynamic_charset_data<CharT> data = {
            name(), id(), replacement_char(), 3, validate, encoded_char_size,
            encode_char, encode_fill, count_codepoints_fast,
            count_codepoints, write_replacement_char, decode_unit,
            strf::dynamic_transcoder<CharT,    CharT>{sanitizer()},
            strf::dynamic_transcoder<char32_t, CharT>{from_u32()},
            strf::dynamic_transcoder<CharT, char32_t>{to_u32()},
            find_transcoder_from<wchar_t>,
            find_transcoder_to<wchar_t>,
            find_transcoder_from<char16_t>,
            find_transcoder_to<char16_t>,
            find_transcoder_from<char>,
            find_transcoder_to<char>,
#if defined (__cpp_char8_t)
            find_transcoder_from<char8_t>,
            find_transcoder_to<char8_t>
#endif // defined (__cpp_char8_t)
        };
        return strf::dynamic_charset<CharT>{data};
    }
};

template <typename CharT>
class static_charset<CharT, strf::csid_utf16>
{
public:
    static_assert(sizeof(CharT) == 2, "Incompatible character type for UTF-16");
    using code_unit = CharT;
    using char_type STRF_DEPRECATED = CharT;

    static STRF_HD const char* name() noexcept
    {
        return "UTF-16";
    };
    static constexpr STRF_HD strf::charset_id id() noexcept
    {
        return strf::csid_utf16;
    }
    static constexpr STRF_HD char32_t replacement_char() noexcept
    {
        return 0xFFFD;
    }
    static constexpr STRF_HD int replacement_char_size() noexcept
    {
        return 1;
    }
    static constexpr STRF_HD int validate(char32_t ch) noexcept
    {
        return ch < 0x10000 ? 1 : ch < 0x110000 ? 2 : -1;
    }
    static constexpr STRF_HD int encoded_char_size(char32_t ch) noexcept
    {
        return 1 + (0x10000 <= ch && ch < 0x110000);
    }

    static STRF_HD CharT* encode_char
        (CharT* dst, char32_t ch) noexcept;

    static STRF_HD void encode_fill
        ( strf::transcode_dst<CharT>&, std::ptrdiff_t count, char32_t ch );

    static STRF_HD strf::count_codepoints_result<CharT> count_codepoints_fast
        ( const CharT* src, const CharT* src_end
        , std::ptrdiff_t max_count ) noexcept;

    static STRF_HD strf::count_codepoints_result<CharT> count_codepoints
        ( const CharT* src, const CharT* src_end
        , std::ptrdiff_t max_count ) noexcept;

    static STRF_HD void write_replacement_char
        ( strf::transcode_dst<CharT>& );

    static STRF_HD char32_t decode_unit(CharT ch) noexcept
    {
        return ch;
    }
    static STRF_HD strf::encode_char_f<CharT> encode_char_func() noexcept
    {
        return encode_char;
    }
    static STRF_HD strf::encode_fill_f<CharT> encode_fill_func() noexcept
    {
        return encode_fill;
    }
    static STRF_HD strf::validate_f validate_func() noexcept
    {
        return validate;
    }
    static STRF_HD strf::write_replacement_char_f<CharT>
    write_replacement_char_func() noexcept
    {
        return write_replacement_char;
    }
    static constexpr STRF_HD strf::utf16_to_utf16<CharT, CharT> sanitizer() noexcept
    {
        return {};
    }
    static constexpr STRF_HD strf::utf32_to_utf16<char32_t, CharT> from_u32() noexcept
    {
        return {};
    }
    static constexpr STRF_HD strf::utf16_to_utf32<CharT, char32_t> to_u32() noexcept
    {
        return {};
    }
    template <typename SrcCharT>
    static STRF_HD strf::dynamic_transcoder<SrcCharT, CharT>
    find_transcoder_from(strf::tag<SrcCharT>, strf::charset_id id) noexcept
    {
        return find_transcoder_from<SrcCharT>(id);
    }
    template <typename DstCharT>
    static STRF_HD strf::dynamic_transcoder<CharT, DstCharT>
    find_transcoder_to(strf::tag<DstCharT>, strf::charset_id id) noexcept
    {
        return find_transcoder_to<DstCharT>(id);
    }
    template <typename DstCharT>
    static STRF_HD strf::dynamic_transcoder<CharT, DstCharT>
    find_transcoder_to(strf::charset_id id) noexcept
    {
        using transcoder_type = strf::dynamic_transcoder<CharT, DstCharT>;
        if (id == strf::get_csid_utf<DstCharT>()) {
            return transcoder_type{strf::utf_to_utf<CharT, DstCharT>{}};
        }
        return {};
    }
    template <typename SrcCharT>
    static STRF_HD strf::dynamic_transcoder<SrcCharT, CharT>
    find_transcoder_from(strf::charset_id id) noexcept
    {
        using transcoder_type = strf::dynamic_transcoder<SrcCharT, CharT>;
        if (id == strf::get_csid_utf<SrcCharT>()) {
            return transcoder_type{strf::utf_to_utf<SrcCharT, CharT>{}};
        }
        return {};
    }
    static strf::dynamic_charset<CharT> to_dynamic() noexcept
    {
        static const strf::dynamic_charset_data<CharT> data = {
            name(), id(), replacement_char(), 1, validate, encoded_char_size,
            encode_char, encode_fill, count_codepoints_fast,
            count_codepoints, write_replacement_char, decode_unit,
            strf::dynamic_transcoder<CharT,    CharT>{sanitizer()},
            strf::dynamic_transcoder<char32_t, CharT>{from_u32()},
            strf::dynamic_transcoder<CharT, char32_t>{to_u32()},
            find_transcoder_from<wchar_t>,
            find_transcoder_to<wchar_t>,
            find_transcoder_from<char16_t>,
            find_transcoder_to<char16_t>,
            find_transcoder_from<char>,
            find_transcoder_to<char>,
#if defined (__cpp_char8_t)
            find_transcoder_from<char8_t>,
            find_transcoder_to<char8_t>
#else
            nullptr,
            nullptr
#endif // defined (__cpp_char8_t)
        };
        return strf::dynamic_charset<CharT>{data};
    }
};

template <typename CharT>
class static_charset<CharT, strf::csid_utf32>
{
public:
    static_assert(sizeof(CharT) == 4, "Incompatible character type for UTF-32");
    using code_unit = CharT;
    using char_type STRF_DEPRECATED = CharT;

    static STRF_HD const char* name() noexcept
    {
        return "UTF-32";
    };
    static constexpr STRF_HD strf::charset_id id() noexcept
    {
        return strf::csid_utf32;
    }
    static constexpr STRF_HD char32_t replacement_char() noexcept
    {
        return 0xFFFD;
    }
    static constexpr STRF_HD std::ptrdiff_t replacement_char_size() noexcept
    {
        return 1;
    }
    static constexpr STRF_HD char32_t u32equivalence_begin() noexcept
    {
        return 0;
    }
    static constexpr STRF_HD char32_t u32equivalence_end() noexcept
    {
        return 0x10FFFF;
    }
    static constexpr STRF_HD int validate(char32_t) noexcept
    {
        return 1;
    }
    static constexpr STRF_HD int encoded_char_size(char32_t) noexcept
    {
        return 1;
    }
    static STRF_HD CharT* encode_char
